# IsPrimary Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DesignOption..::..IsPrimary Property
DesignOption Class See Also
---
Determines whether this is a primary design option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsPrimary { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPrimary As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPrimary {
	bool get ();
}
```

# See Also
DesignOption Class
Autodesk.Revit.DB Namespace